# 2. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
#   *Примеры:*
#   - 6,78 -> 7
#  - 5 -> нет
# - 0,34 -> 3

number = 5.99
number = number*10
print(number)

#Напишите программу, которая принимает на вход число и проверяет,
#кратно ли оно 5 и 10 или 15, но не 30.


#1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
#   *Пример:*    
#  - Для N = 5: 1, -3, 9, -27, 81
